src/InformationRegisters/ИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗвонков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗвонящийНомер</Name>
					<Comment>called_phone_number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВызываемыйНомер</Name>
					<Comment>calling_phone_number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Comment>start_time (YYYY-MM-DD hh:mm:ss)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Comment>total_time_duration</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Comment>wait_time_duration</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаЗапись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Comment>virtual_phone_number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Входящий</Name>
					<Comment>direction=in</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСессии</Name>
					<Comment>call_session_id</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияЗвонков/Ext/ManagerModule.bsl
// Внешние методы
#Область ПрограммныйИнтерфейс

// Процедура - Создать запись
//
// Параметры:
//  соотвПолейЗвонков - Структура - ВСЕ измерения + Ресурсы
//
Процедура СоздатьЗапись( соотвПолейЗвонков ) Экспорт 
	
	// обязательное Измерения!
	Если НЕ соотвПолейЗвонков.Свойство("Номер")
		ИЛИ НЕ соотвПолейЗвонков.Свойство("Входящий") Тогда
		Возврат; 	
	КонецЕсли;
	
	рс = РегистрыСведений.ИсторияЗвонков.СоздатьМенеджерЗаписи();
	
	рс.Период = ТекущаяДатаСеанса(); // текущая дата и время   
	Для каждого эл Из соотвПолейЗвонков Цикл
		рс[эл.Ключ]	= эл.Значение;
	КонецЦикла;
	
	рс.Записать(Истина); // запись может дополняться ПОСЛЕ создания!  
	
КонецПроцедуры	

// Функция - Получить запись
//
// Параметры:
//  Номер - строка - виртуальный номер
//  Входящий - булево - признак входящий звонок, иначе Исходящий
//  ИдСессии - число - идентификатор сессии звонка
// 
// Возвращаемое значение:
//  Структура, Неопределено - все поля регистра сведений
//
Функция ПолучитьЗапись( Номер = "", Входящий = Истина, ИдСессии = 0 ) Экспорт
	рез = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Входящий", Входящий);
	Запрос.УстановитьПараметр("ИдСессии", ИдСессии); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсторияЗвонков.*
	|ИЗ
	|	РегистрСведений.ИсторияЗвонков.СрезПоследних( ,
	|			Номер = &Номер
	|				И Входящий = &Входящий
	|				И ИдСессии = &ИдСессии) КАК ИсторияЗвонков";
	
	Результат = Запрос.Выполнить(); 
	Если НЕ Результат.Пустой() Тогда 
		табл = Результат.Выгрузить();
		рез = Новый Структура;
		Для каждого ст Из табл.Колонки Цикл
			рез.Вставить(ст.Имя, табл[0][ст.Имя] ); 
		КонецЦикла;
	КонецЕсли;
	
	Возврат рез;
КонецФункции
 
#КонецОбласти
